package main

import "fmt"

// time - O(n), mem - O(n)
/*
	нужно чтобы в том же ряду, строке и квадрате ничего не было
*/
func isValidSudoku(board [][]byte) bool {

	//81 клетка всего, все их проходим
	for r := 0; r < 9; r++ {
		seenRow := map[byte]bool{}
		seenCol := map[byte]bool{}
		seenSqr := map[byte]bool{}

		//9 элементов в квадрате, строке и столбце
		for i := 0; i < 9; i++ {
			//check row
			rowV := board[r][i]
			if string(rowV) != "." {
				//check if seen
				s := seenRow[rowV]
				if s {
					return false
				} else {
					seenRow[rowV] = true
				}
			}

			//check col
			colV := board[i][r]
			if string(colV) != "." {
				//check if seen
				s := seenCol[colV]
				if s {
					return false
				} else {
					seenCol[colV] = true
				}
			}

			//check sqrt
			rowN := i/3 + ((r / 3) * 3)
			columnN := i%3 + ((r % 3) * 3)
			sqrV := board[rowN][columnN]
			if string(sqrV) != "." {
				s := seenSqr[sqrV]
				if s {
					return false
				} else {
					seenSqr[sqrV] = true
				}
			}
		}
	}

	return true
}

func main() {

	// board := [][]byte{
	// 	{'5', '3', '.', '.', '7', '.', '.', '.', '.'},
	// 	{'6', '.', '.', '1', '9', '5', '.', '.', '.'},
	// 	{'.', '9', '8', '.', '.', '.', '.', '6', '.'},
	// 	{'8', '.', '.', '.', '6', '.', '.', '.', '3'},
	// 	{'4', '.', '.', '8', '.', '3', '.', '.', '1'},
	// 	{'7', '.', '.', '.', '2', '.', '.', '.', '6'},
	// 	{'.', '6', '.', '.', '.', '.', '2', '8', '.'},
	// 	{'.', '.', '.', '4', '1', '9', '.', '.', '5'},
	// 	{'.', '.', '.', '.', '8', '.', '.', '7', '9'},
	// }

	// board := [][]byte{
	// 	{'8', '3', '.', '.', '7', '.', '.', '.', '.'},
	// 	{'6', '.', '.', '1', '9', '5', '.', '.', '.'},
	// 	{'.', '9', '8', '.', '.', '.', '.', '6', '.'},
	// 	{'8', '.', '.', '.', '6', '.', '.', '.', '3'},
	// 	{'4', '.', '.', '8', '.', '3', '.', '.', '1'},
	// 	{'7', '.', '.', '.', '2', '.', '.', '.', '6'},
	// 	{'.', '6', '.', '.', '.', '.', '2', '8', '.'},
	// 	{'.', '.', '.', '4', '1', '9', '.', '.', '5'},
	// 	{'.', '.', '.', '.', '8', '.', '.', '7', '9'},
	// }

	board := [][]byte{
		{'.', '.', '.', '.', '5', '.', '.', '1', '.'},
		{'.', '4', '.', '3', '.', '.', '.', '.', '.'},
		{'.', '.', '.', '.', '.', '3', '.', '.', '1'},
		{'8', '.', '.', '.', '.', '.', '.', '2', '.'},
		{'.', '.', '2', '.', '7', '.', '.', '.', '.'},
		{'.', '1', '5', '.', '.', '.', '.', '.', '.'},
		{'.', '.', '.', '.', '.', '2', '.', '.', '.'},
		{'.', '2', '.', '9', '.', '.', '.', '.', '.'},
		{'.', '.', '4', '.', '.', '.', '.', '.', '.'},
	}

	fmt.Println(isValidSudoku(board))

}
